# SchedulableField Properties

---
The SchedulableField type exposes the following members.
| Name| Description
---|---|---
| FieldType|  The type of data displayed by the field.
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
| ParameterId|  The ID of the parameter displayed by the field.
Top
#### Reference
SchedulableField Class
Autodesk.Revit.DB Namespace